# Section 26 Part 2:  Joining Dataframes with Pandas

#### Lecture 149:  Introduction to Joining Dataframes
#### Lecture 150:  Vertical Merge (Concat)
#### Lecture 151:  Horizontal Merge (Inner Join)
#### Lecture 152:  Horizontal Merge (Outer/Left/Right)
#### Lecture 153:  Financial Ratios Case
#### Lecture 154:  Financial Ratios:  Merge
#### Lecture 155:  Financial Ratios:  Calculations
#### Lecture 156:  Financial Ratios:  Solutions

In [40]:
import pandas as pd
import numpy as np

In [41]:
df_1 = pd.DataFrame(
    {
        "Name": ['Oliver', 'Emma', 'Jack'],
        'Age': [21, 24, 36],
        'Education': ['BSc', 'BA', 'MSc']
    }
)

df_2 = pd.DataFrame(
    {
        'Name': ['Jimmy', 'Frank', 'Sue', 'Ava'],
        'Age': [20, 18, 65, 40],
        'Income': [40000, 0, 12000, 30000]
    }
)

df_3 = pd.DataFrame(
    {
        'Name': ['Emma', 'Jack', 'Mia'],
        'Position': ['Manager', 'CFO', 'analyst'],
        'Salary': [78000, 160000, 50000],
        'Education': ['BA', 'PhD', 'BSc']
    }
)

In [42]:
df_1

     Name  Age Education
0  Oliver   21       BSc
1    Emma   24        BA
2    Jack   36       MSc

In [43]:
df_2

    Name  Age  Income
0  Jimmy   20   40000
1  Frank   18       0
2    Sue   65   12000
3    Ava   40   30000

In [44]:
df_3

   Name Position  Salary Education
0  Emma  Manager   78000        BA
1  Jack      CFO  160000       PhD
2   Mia  analyst   50000       BSc

#### 1\) Vertically Combine Data Frames:

In [45]:
pd.concat([df_1, df_2])

     Name  Age Education   Income
0  Oliver   21       BSc      NaN
1    Emma   24        BA      NaN
2    Jack   36       MSc      NaN
0   Jimmy   20       NaN  40000.0
1   Frank   18       NaN      0.0
2     Sue   65       NaN  12000.0
3     Ava   40       NaN  30000.0

In [46]:
# Can explicitly join outer:

pd.concat([df_1, df_2], join = 'outer')

     Name  Age Education   Income
0  Oliver   21       BSc      NaN
1    Emma   24        BA      NaN
2    Jack   36       MSc      NaN
0   Jimmy   20       NaN  40000.0
1   Frank   18       NaN      0.0
2     Sue   65       NaN  12000.0
3     Ava   40       NaN  30000.0

In [47]:
# Grab only common columns - inner join
pd.concat([df_1, df_2], join = 'inner')

     Name  Age
0  Oliver   21
1    Emma   24
2    Jack   36
0   Jimmy   20
1   Frank   18
2     Sue   65
3     Ava   40

In [48]:
# Columns Sorted Alphabetically

pd.concat([df_1, df_2], join = 'outer', sort=True)

   Age Education   Income    Name
0   21       BSc      NaN  Oliver
1   24        BA      NaN    Emma
2   36       MSc      NaN    Jack
0   20       NaN  40000.0   Jimmy
1   18       NaN      0.0   Frank
2   65       NaN  12000.0     Sue
3   40       NaN  30000.0     Ava

#### 2\) Horizontally Join/Merge Datasets:
#### 2i\) Inner Join:

In [49]:
df_1.merge(df_3, on='Name')

   Name  Age Education_x Position  Salary Education_y
0  Emma   24          BA  Manager   78000          BA
1  Jack   36         MSc      CFO  160000         PhD

In [50]:
# Or specifically mentioning join type:

df_1.merge(df_3, on='Name', how='inner')

   Name  Age Education_x Position  Salary Education_y
0  Emma   24          BA  Manager   78000          BA
1  Jack   36         MSc      CFO  160000         PhD

In [51]:
# Over-ride the automatic _x and _y suffixes to the column names:

df_1.merge(df_3, on='Name', how='inner', suffixes=['_1', '_2'])

# Seems Jack is either 2 different people or there is an error in one of the databases.
# Shouldn't ever really use a name column as a primary key to join tables.

   Name  Age Education_1 Position  Salary Education_2
0  Emma   24          BA  Manager   78000          BA
1  Jack   36         MSc      CFO  160000         PhD

In [52]:
# Alternative Method of Calling merge:

pd.merge(df_1, df_3, on='Name', how='inner', suffixes=['_1', '_2'])

   Name  Age Education_1 Position  Salary Education_2
0  Emma   24          BA  Manager   78000          BA
1  Jack   36         MSc      CFO  160000         PhD

In [53]:
# Sort the Dataset:

df_1.merge(df_3, on='Name', sort=True)

   Name  Age Education_x Position  Salary Education_y
0  Emma   24          BA  Manager   78000          BA
1  Jack   36         MSc      CFO  160000         PhD

#### 2ii\) Outer Joins

In [54]:
df_1.merge(df_3, on='Name', suffixes=['_1', '_2'], how='outer', sort=True)

     Name   Age Education_1 Position    Salary Education_2
0    Emma  24.0          BA  Manager   78000.0          BA
1    Jack  36.0         MSc      CFO  160000.0         PhD
2     Mia   NaN         NaN  analyst   50000.0         BSc
3  Oliver  21.0         BSc      NaN       NaN         NaN

In [55]:
# Left Outer Join:

df_1.merge(df_3, on='Name', how='left', sort=True)

     Name  Age Education_x Position    Salary Education_y
0    Emma   24          BA  Manager   78000.0          BA
1    Jack   36         MSc      CFO  160000.0         PhD
2  Oliver   21         BSc      NaN       NaN         NaN

In [56]:
# Right Join:

df_1.merge(df_3, on='Name', how='right', sort=True)

   Name   Age Education_x Position  Salary Education_y
0  Emma  24.0          BA  Manager   78000          BA
1  Jack  36.0         MSc      CFO  160000         PhD
2   Mia   NaN         NaN  analyst   50000         BSc

In [64]:
# right_on and left_on parameters:

# copy df_3 tio new df to work on:

df_4 = df_3.copy()
# df_4
# Rename Name Column:

df_4.rename({'Name': 'First_Name'}, inplace=True, axis=1)
# df_4

pd.merge(df_1, df_4, left_on='Name', right_on='First_Name', how='outer', sort=True)

     Name   Age Education_x First_Name Position    Salary Education_y
0    Emma  24.0          BA       Emma  Manager   78000.0          BA
1    Jack  36.0         MSc       Jack      CFO  160000.0         PhD
2     NaN   NaN         NaN        Mia  analyst   50000.0         BSc
3  Oliver  21.0         BSc        NaN      NaN       NaN         NaN